# 记录了每张卡图哈希值对应着哪张卡
# 请使用 identify_cards_demo.py 获取哈希值
from constants.card_name import *

CARD_HASH_INFO = {
    "c1cd1e56646b3a0f": NAME_THE_COIN,
    "e9b7934026cd445f": "香蕉",

    # T7猎
    "c1b1b6ce831aa86f": "森林狼",
    "e0f1855cd38db8c5": "麻风侏儒",
    "a74e898b8a6dc837": "叫嚣的中士",
    "f80f36f0439e7a22": "奥术射击",
    "f03e2a49c569da17": "狼人渗透者",

    "b191be7e9462a436": "飞刀杂耍者",
    "b4a5b5d6c6128eb8": "食腐土狼",
    "b15ed2188f912de5": "饥饿的秃鹫",
    "a5b0bca4a7719672": "恐狼前锋",

    "a4769f96529a6172": "杀戮指令",
    "8e72637cb20d8c73": "奥数傀儡",
    "c646693d3e4ca5c3": "鹰角弓",
    "b076876e0e1be8e8": "狼骑兵",
    "a251d34aad0d6dae": "动物伙伴",
    "8ceccb53940ce1de": "穆克拉",
    "b1dbce6585960b8a": "关门放狗",

    "9496836db56e4e26": "火车王",

    # 解解牧
    "d56cb490a9a68f9a": "神圣惩击",
    "a5c2b77992768607": "护甲商贩",
    "936d6e83691eae50": "倦怠光波",

    "beb38a68b52d8272": "噬骨斗殴者",
    "c5c12312e8ef7c8d": "暗言术灭",

    "87e6328f6b10cf0b": "噬灵疫病",
    "b2f03d8f4d1d3c48": "神圣化身",
    "ced230c4833dcf53": "亡首教徒",
    "e2b69f539143c0cb": "狂傲的兽人",

    "e59318ec591ba6e1": "暗言术毁",
    "a3c1d89e94756f42": "狂乱",
    "bf8080470f6fec78": "神圣新星",

    "9dfec6928bc92d01": "除奇致胜",
    "e0c4945e8e1f9d78": "锈骑劫匪",
    "e5e149439c4dc37a": "泰兰佛丁",

    "f86614f12e28937e": "凯恩血蹄",

    "fc9913162f6b6829": "灵魂之镜",
    "96729b3e646569c4": "吃手手鱼",

    "94c64f69ca629f34": "娜塔莉塞林",

    "e962938d37d09e0e": "戈霍恩之血",
}

# 不同的攻击血量数字的哈希
NUMBER_HASH = {
    "81b31fcd2a966d13": 0,
    "98613739342c67cf": 1,
    "85b21d1d5bc46cb3": 2,
    "959bc2a50fc2397a": 3,
    "95363ce1670ecc99": 4,
    "c71b4e353cc02d79": 5,
    "c0531fa4be9d686a": 6,
    "93b5e5c93b1a7260": 7,
    "85975ae11ace6cb1": 8,
    "84b15b0f4ae63dc9": 9,
    "b45769ab43565255": 10,
}
